app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def index
    @pictures = Picture.all

INSERT INTO "pictures" ("avatar", "caption", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_picture
      @picture = Picture.find(params[:id])